{
  "answers": [
    "Not mentioned in the policy.",
    "Yes, provided the arrest is made under a law providing for preventive detention, or if the person is an enemy alien. \nOtherwise, the arrested person must be informed of the grounds for the arrest and produced before a magistrate within 24 hours, excluding travel time. \nAdditionally, certain conditions must be met for detention without a warrant, including a 3-month or 2-month limit, depending on the Advisory Board's report.",
    "No, it is not allowed. According to Article 21 of the Constitution of India, no person shall be deprived of their life or personal liberty except according to procedure established by law, and Article 38 ensures that the ownership and control of material resources are distributed to subserve the common good, including equal pay for equal work for both men and women, and that citizens are not forced by economic necessity to enter avocations unsuited to their age or strength. Furthermore, clause (e) of the Directive Principles of State Policy under Article 38 aims to ensure that the health and strength of workers, men and women, and the tender age of children are not abused.",
    "No. The context explicitly states that laws made under Article 243K of the Constitution of India allow for the compulsory acquisition of land for public purposes by the Government of the State, provided it is done in accordance with the law for the time being in force authorizing such acquisition. Therefore, if the government takes your land for a project under such legal authority, you cannot stop it.",
    "No, it is not legal. According to Article 24 of the Constitution of India, the prohibition of employment of children in factories or other hazardous occupations is explicitly stated. The context specifies that the health and strength of workers, including children, must not be abused, and citizens must not be forced by economic necessity to enter avocations unsuited to their age or strength. Therefore, forcing a child to work in a factory violates this constitutional provision.",
    "Yes, if you are stopped from speaking at a protest, it may violate your rights under **Article 19(1)(a)** of the Constitution of India, which guarantees the right to freedom of speech and expression. However, this right is subject to **reasonable restrictions** under **Article 19(2)**, which permits the State to impose restrictions in the interests of public order, sovereignty and integrity of India, or security of the State. If the restriction is arbitrary or disproportionate, it may be unconstitutional. The context does not specify the circumstances of the restriction, so further details would be required to determine its validity.",
    "No, subject to public order, morality and health and to the other provisions of this Part, all persons are equally entitled to freedom of conscience and the right freely to profess, practice and propagate religion; however, the State may make any law regulating or restricting any economic, financial, political or other secular activity which may be associated with religious practice, or providing for social welfare and reform or the throwing open of Hindu religious institutions of a public character to all classes and sections of Hindus.",
    "No, the government cannot stop a person from changing their religion. The document does not mention any provisions that restrict an individual from changing their religion; in fact, it emphasizes promoting harmony and the spirit of common brotherhood amongst all the people of India, transcending religious diversities, as stated in Article 294 (e).",
    "The right being violated is the protection of life and personal liberty, as no person shall be deprived of their life or personal liberty except according to procedure established by law, as stated in the Constitution. Specifically, this right is protected under Article 21, which ensures that individuals are safeguarded against arbitrary detention and torture while in custody.",
    "Not mentioned in the policy."
  ]
}