{
  "answers": [
    "The Grace Period for payment of the premium shall be thirty days. Coverage shall not be available during the period for which no premium is received.",
    "Expenses related to the treatment of a Pre-Existing Disease (PED) and its direct complications shall be excluded until the expiry of thirty six (36) months of continuous coverage after the date of inception of the first policy with us. \n\nHowever, if the Insured Person is continuously covered without any break as defined under the portability norms of the extant IRDAI (Health Insurance) Regulations, then waiting period for the same would be reduced to the extent of prior coverage. \n\nAdditionally, coverage under the policy after the expiry of thirty six (36) months for any pre-existing disease is subject to the same being declared at the time of application and accepted by us.",
    "Yes. Maternity expenses are covered under Section 3.1.14, but expenses for surrogate mother are covered under Section 3.1.14 and a legal affidavit regarding intimation of surrogacy must be submitted. Additionally, the policy covers maternity expenses for the insured and his spouse if covered by the Policy, provided the Policy has been continuously in force for twenty-four (24) months from the inception of the Policy or from the date of inclusion of the insured person, whichever is later. There is a limit on claims for maternity expenses; a maximum of two claims are admissible by the Policy during the lifetime of the insured person if he has no living child and one claim if the insured has one living child. Any one illness limit does not apply.",
    "The waiting period for cataract surgery is two years, as specified under section 4.2.f.iii, however, the limit shall not apply if the treatment is undergone for a listed procedure in a Preferred Provider Network (PPN) as a package.",
    "Yes. The Company shall indemnify the Medical Expenses incurred in respect of an organ donor’s Hospitalisation during the Policy Period for harvesting of the organ donated to an Insured Person, provided that: \ni. The organ donation confirms to the Transplantation of Human Organs Act1994 (and its amendments from time to time); \nii. The organ is used for an Insured Person and the Insured Person has been medically advised to undergo an organ transplant; \niii. The Medical Expenses shall be incurred in respect of the organ donor as an in-patient in a Hospital; \niv. Claim has been admitted under In-patient Treatment Section in respect of the Insured Person undergoing the organ transplant.",
    "A No Claim Discount (NCD) of flat 5% shall be allowed on the base premium, provided claims are not reported in the expiring Policy. On renewal of policies with a term exceeding one year, the NCD amount with respect to each claim-free policy year shall be aggregated and allowed on renewal, with an aggregate amount of NCD not exceeding flat 5% of the total base premium for the term of the policy.",
    "Not mentioned in the policy.",
    "Hospital means any institution established for in-patient care and day care treatment of disease/ injuries and which has been registered as a hospital with the local authorities under the Clinical Establishments (Registration and Regulation) Act, 2010 or under the enactments specified under Schedule of Section 56(1) of the said Act, OR complies with all minimum criteria as under: \ni. has qualified nursing staff under its employment round the clock; \nii. has at least ten inpatient beds, in those towns having a population of less than ten lacs and fifteen inpatient beds in all other places; \niii. has qualified medical practitioner (s) in charge round the clock; \niv. has a fully equipped operation theatre of its own where surgical procedures are carried out \nv. maintains daily records of patients and shall make these accessible to the Company’s authorized personnel.",
    "The Company shall indemnify Medical Expenses incurred for Inpatient Care treatment under Ayurveda, Yoga and Naturopathy, Unani, Siddha, and Homeopathy systems of medicines during each Policy Period up to the limit of Sum Insured as specified in the Policy Schedule in any AYUSH Hospital. This coverage is subject to the insured receiving treatment in a facility that meets the criteria outlined for an AYUSH Hospital, including having at least five inpatient beds, qualified AYUSH Medical Practitioners, dedicated therapy sections, and proper record-keeping. The treatment must be carried out by registered AYUSH Medical Practitioners under the specified conditions.",
    "Yes, there are sub-limits on room rent and ICU charges for Plan A. Room charges and intensive care unit charges per day shall be payable up to the limit as shown in the Table of Benefits, for Plan A only. However, the limit shall not apply if the treatment is undergone for a listed procedure in a Preferred Provider Network (PPN) as a package."
  ]
}