{
  "answers": [
    "The Company shall settle or reject a claim, as the case may be, within 15 days from the date of receipt of last necessary document. However, if circumstances warrant an investigation, it shall be completed within 30 days, and the claim shall be settled or rejected within 45 days from the date of receipt of last necessary document. \n\nYou are required to submit the claim with full particulars within thirty days of date of discharge from hospital for reimbursement of hospitalisation, day care and pre hospitalisation expenses. \n\nAlso, please note that the policy has a co-payment clause: 5% Co-pay on all claims for age less than equal to 75 years and 15% Co-pay on all claims for age greater than 75 years. \n\nThe claim amount will be paid after deducting the co-payment. \n\nYou may want to check with the insurer for additional documentation requirements.",
    "Not mentioned in the policy.",
    "No, the cataract treatment expenses are limited to up to 25% of the Sum Insured or Rs.40,000/-, whichever is lower, per eye, under one policy year. \n\nFor example, if your Sum Insured is Rs200,000, the maximum payable for cataract treatment would be 25% of Rs200,000, which is Rs50,000, or Rs40,000, whichever is lower. \n\nIn your case, the settlement would be limited to Rs40,000. \n\nAdditionally, a co-payment of 5% for Insured Person aged less than or equal to 75 years or 15% for Insured Person aged greater than 75 years on policy inception will be applied to the claim amount.",
    "The documents to be uploaded for hospitalization for heart surgery, as per the policy context, are as follows:\n\n1. **Duly completed claim form**\n2. **Photo Identity proof of the patient**\n3. **Medical practitioner’s prescription advising admission**\n4. **NEFT Details (to enable direct credit of claim amount in bank account) and cancelled cheque**\n5. **KYC (Identity proof with Address) of the proposer, where claim liability is above Rs. 1 Lakh as per AML Guidelines**\n6. **Legal heir/succession certificate, wherever applicable**\n7. **Any other relevant document required by Company/TPA for assessment of the claim**\n\nAdditionally, the policy specifies that the company shall only accept bills/invoices/medical treatment-related documents in the insured person's name. If original documents were submitted to another insurer, certified copies and claim settlement advice from the other insurer may be accepted. The claim must be submitted within the prescribed time limits: within **30 days of discharge** for hospitalization expenses and within **15 days from completion of post-hospitalization treatment** for post-hospitalization expenses."
  ]
}